# Вправа 1: Проста математика
print("\n=== ВПРАВА 1: Калькулятор ===")
print("Створіть простий калькулятор для двох чисел і двох дій")
print("Підтримувані операції: +, -")

# Початок реалізації:

number1 = int(input("Введіть число: "))
operation = input("Введіть операцію (+, -): ")
number2 = int(input("Введіть число: "))
if operation == "+":
    print(number1 + number2)
elif operation == "-":
    print(number1 - number2)   
else:
    print("Error")     

  # Вправа 2: Перевірка паролю
print("\n=== ВПРАВА 2: Перевірка паролю ===")
print("Створіть систему перевірки паролю")
print("Пароль повинен містити принаймні 8 символів")

password = input("Мінімальна кількість символів 8: ")
if len(password) < 8:
    print("Error. Add char")
else:
    print("Password saved")    

# Вправа 3: Визначення високосного року
print("\n=== ВПРАВА 3: Високосний рік ===")
print("Рік є високосним, якщо:")
print("- Ділиться на 4 І не ділиться на 100")
print("- АБО ділиться на 400")

year = 1999
if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0:
    print("Високосний рік")
else:
    print("Рік не високосний")    

# Вправа 4: Лічильник голосних
print("\n=== ВПРАВА 4: Лічильник голосних ===")
print("Підрахуйте кількість голосних у рядку")

text = input("введіть текст: ").lower()
vowels = "аеиіїоуюя"
count = 0
for char in text:  
    if char in vowels:  
        count += 1
    print(f"Кількість голосних: {count}")


# Вправа 5: Гра 
print("\n=== ВПРАВА 5: Гра ===")
"""
Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо колір прибульця green, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця yellow, надрукуйте, що гравець щойно заробив 10 балів.
Якщо колір прибульця red - надрукуйте, що гравець щойно заробив 15 балів.
Перевірте роботу гри самостійно, змінюючи значення alien_color
"""
alien_color = "green"
if alien_color == "green":
    print("gamer get 5 point")
elif alien_color == "yellow":    
    print("gamer get 10 point")
else:print("gamer get 15 point")


# Вправа 6: Піцерія *
print("\n=== ВПРАВА 6: Начинки для піци (pizza_topping) ===")
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""

while True:
    topping = input("Введіть начинку для піци (або 'quit' для завершення): ").lower()
    
    if topping == 'quit':
        print("Замовлення прийнято! Ваша піца готується.")
        break  # зупиняє цикл і виходить з програми
        
    print(f"Ми додаємо {topping} до вашої піци!"


# Вправа 7: Зворотний порядок цифр
print("\n=== ВПРАВА 7: Зворотний порядок ===")
print("Виведіть цифри числа у зворотному порядку")

num = 45869
print(str(num) [::-1])




# Вправа 8: Пошук максимального числа
print("\n=== ВПРАВА 8: Пошук максимального ===")
print("Знайдіть найбільше число серед введених")
print("Введіть 0 для завершення")

numbers = []  

while True:
    num = int(input("Введіть число: "))
    if num == 0:
        break 
    numbers.append(num)  

if numbers:
    print(f"Найбільше введене число: {max(numbers)}")
else:
    print("Ви не ввели жодного числа, окрім 0.")

# Вправа 9: Виключення зі списку
print("\n=== ВПРАВА 9: Виключення зі списку ===")
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
fruits = ["apple", "banana", "orange", "grape", "mango"]
for fruit in fruits:
    if fruit == "orange":
        continue
    print(fruit)    

# Вправа 10: Вираз в один рядок
print("\n=== ВПРАВА 10: Вираз з умовою в один рядок ===")
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [x**2 for x in numbers if x % 2 == 0]
print(result)  #  [4, 16, 36, 64, 100]
